gopath/src/pkg/acs/cwmp/trans_complete.xml

<?xml version="1.0" encoding="utf-8"?>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">156753</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <cwmp:TransferComplete>
      <CommandKey>2ff380e1d6799f80</CommandKey>
      <FaultStruct>
        <FaultCode>9010</FaultCode>
        <FaultString>Download failure</FaultString>
      </FaultStruct>
      <StartTime>2016-07-08T07:57:38Z</StartTime>
      <CompleteTime>2016-07-08T07:57:38Z</CompleteTime>
    </cwmp:TransferComplete>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
